data/Parm_PH_29/alpha_15/alpha_15_7929_2024/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
15600
(
(0.0348279109254663 1.00078219967173 1.61934520577424e-18)
(0.104483732776399 1.00078219967173 3.43143746465215e-18)
(0.174146470907575 1.00037187761151 9.62900748209855e-20)
(0.243790147082894 0.998311357986826 0)
(0.313292977228853 0.993436768475978 -5.00036820068951e-18)
(0.382443561504889 0.984962047174143 -3.26930105054015e-18)
(0.450893848437823 0.972056807070048 9.48656925669535e-20)
(0.518219266644015 0.954217700851973 -6.25667604051063e-18)
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0348314189324666 1 0)
(0.1044942567974 1 0)
(0.174152695832637 0.999589007234918 0)
(0.243769347825687 0.997526464458386 0)
(0.313236521568074 0.992648319239577 0)
(0.382340528120842 0.984170206067871 0)
(0.450736544757755 0.971263123592508 0)
(0.518008079788288 0.953422249155513 0)
...
)
;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
120
(
(0.0330375 2.024 0)
(0.0991125 2.024 0)
(0.1651875 2.024 0)
(0.2312625 2.024 0)
(0.2973375 2.024 0)
(0.3634125 2.024 0)
(0.4294875 2.024 0)
(0.4955625 2.024 0)
...
)
;
    }
    inlet_half0
    {
        type            cyclic;
    }
    inlet_half1
    {
        type            cyclic;
    }
    outlet_half0
    {
        type            cyclic;
    }
    outlet_half1
    {
        type            cyclic;
    }
    sideRight_half0
    {
        type            empty;
    }
    sideRight_half1
    {
        type            empty;
    }
    sideLeft_half0
    {
        type            empty;
    }
    sideLeft_half1
    {
        type            empty;
    }
}


// ************************************************************************* //
