data/Parm_PH_29/alpha_15/alpha_15_7929_2024/0/U_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector>
15600
(
(0.15232538 -0.00094264 0.00000000)
(0.17350635 -0.00115184 0.00000000)
(0.18665716 -0.00116017 0.00000000)
(0.14121663 -0.00061769 0.00000000)
(0.01887151 -0.01321930 0.00000000)
(0.01119715 -0.00044950 0.00000000)
(-0.00015393 -0.00228154 0.00000000)
(-0.00569215 0.00342485 0.00000000)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
