data/Parm_PH_29/alpha_15/alpha_15_7929_2024/0/tauij_LES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      tauij_LES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor>
15600
(
(0.01137231 -0.00013155 0.00000000 0.00002559 0.00000000 0.00597503)
(0.01210764 -0.00016294 0.00000000 0.00003404 0.00000000 0.00651361)
(0.01192097 -0.00016979 0.00000000 0.00002916 0.00000000 0.00638907)
(0.00802035 -0.00005541 0.00000000 -0.00001299 0.00000000 0.00389666)
(0.00003343 -0.00012141 0.00000000 0.00010281 0.00000000 0.00161467)
(0.00091125 -0.00003104 0.00000000 -0.00000874 0.00000000 0.00034129)
(0.00107240 -0.00007710 0.00000000 0.00003700 0.00000000 0.00379026)
(0.00003633 -0.00024202 0.00000000 0.00023056 0.00000000 0.00253205)
...
)
;

boundaryField
{
    bottomWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    topWall
    {
        type        fixedValue;
        value       uniform (0 0 0 0 0 0);
    }
    inlet_half0
    {
        type        cyclic;
    }
    inlet_half1
    {
        type        cyclic;
    }
    outlet_half0
    {
        type        cyclic;
    }
    outlet_half1
    {
        type        cyclic;
    }
    sideRight_half0
    {
        type        empty;
    }
    sideRight_half1
    {
        type        empty;
    }
    sideLeft_half0
    {
        type        empty;
    }
    sideLeft_half1
    {
        type        empty;
    }
}

// ************************************************************************* //
